#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/terrastates/QuackyNotesInfra/runs/run-zipsznb7SuP8344G

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
aws_key_pair.production_key: Refreshing state... [id=production-key]
aws_security_group.production_rules: Refreshing state... [id=sg-027221a763bdfebff]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo_PR_2 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_2" {
      + ami                                  = "ami-007855ac798b5175e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_2"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "c4a49a72b18dfcc57129c36641e4f8fa271e493d"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.production_key will be destroyed
  # (because aws_key_pair.production_key is not in configuration)
  - resource "aws_key_pair" "production_key" {
      - arn         = "arn:aws:ec2:us-east-1:608337043546:key-pair/production-key" -> null
      - fingerprint = "3e:90:12:09:7f:7d:dc:68:9b:ee:0a:a2:a8:f7:1e:f0" -> null
      - id          = "production-key" -> null
      - key_name    = "production-key" -> null
      - key_pair_id = "key-0de0d5c56d9a952d5" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQClvW7BtCjG4zojj6OqNVJyxyLJN6roR5nb+Elc4wuug/utWQAB7p6rnOYSte+0WLTPdliYWVY/MjRp54EQEtX5VwPtszzOh6xVLDDDjxZKf5g8+VJjFmkLJshDGfcjVRdak/HeXAbSihzmdR9fT7z4AJKzGcGvxJgyQo5gxJFlFdIIrMYLgqkBy9WAkF1w5qjXxc1ymcCoyDjO9OI+WxhlLmN6LIfk4gDb4VjxgLlBxF1B1/js6sbYXum8rKdiQuIbQCudlyWXNwA+xGSRE5W6XQeaNs2xrRFIl+uYI0O56M9h03JePSKdRnTvjUn+crtHWD6ZrlpMDeX6q37OkYcoUlF/Rnx+9Uxbgm6iCzXqYDQ18YsFvtQiUHduOZjeTcR8ZczOT2d5MhpGTCbmSx9LKC2FwILRrPRKc1I8LGT7kquUFL7vJ7AB4K4SBf6QN8Zv38wRIW+Wfy19nIeX8qWN/ugWm9gop2VKWPQUhdkPOHeofdHyGNBGrYtYEzMg2aVn3ePwIu0ZO1mUw7wrnOKVOzu3LW2CQrT/ml4G/4gMSu2Twwyuk2yIqDHavh0FufzayZuHVjGlT7/wSauKnvhb0X28pNM7QNLjP6VmGa4jj1c/EUpQ5hBO39QmCOc1pJ7ozuK+yohEfm1L/cVgJllq9EiOAajD3FQL/+1PVIVtTw== ubuntu@production-server" -> null
      - tags        = {
          - "Name" = "production_public_key"
        } -> null
      - tags_all    = {
          - "Name" = "production_public_key"
        } -> null
    }

  # aws_key_pair.staging_key will be created
  + resource "aws_key_pair" "staging_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "staging-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDEXS4XAPmlEF+zzxRInttT2PocN/8l+0nvU7oRmFuusbUyBHJ2ZhpCTxvgJTa6MdD+z1+XeMJxPzS0Rt7VL1gY1JBz10+9oBWDqzbGanVC6XHiiTYFQeK3SKDK4Lc0IA2KxaO4yNeQeGMXJoVYXpM0a4NE6ASXtYeAIjnqlw53IZvuS8mGNpYe+1DrJzQxAeoC2v5o+bPfxCVZtR/CrCZinb7LdQTBskwepUeOZkqJbtbZNiysqqJsnaZuEK9mBCUisa0+2Kpv0wtAToKOfNo+QokKOdi5J6l/ZqOCwfkyiyJ9tlRAi9U9Yj166lEO9SGkIxeu8QlcbH8Sl4M+pW5zKfFr03BXUf+PQFXOZmozPD7gns3eAf6q7a+t20C3GZ/UU37hk4fteRHV8DClInJbqhvlPIf7peWb4i/ocAyX3BKGKuEtrYDGWMQxkeFoEodgOsAMxQ3KEX0HOUSCjtlpEN1lBbxqXDYLb0xdA900KKhEVYfkmnGrQprZDm9LCJwR94woPSQdt4GfXXpKx2Wr55NHRRmcULXcTAI1DroBawbO3seaZ+SOpVBCAhbg4SZ2FyAmJg24N8gh67o1N9iueS+0yVZKXfoepzvee55Y1ijYCaPtJI2nohWEVJMbGoJhXNcDWdS4byb6Z1R2tKpI4ivE60NDzKSFTqyaaMng0Q== ubuntu@staging-server"
      + tags            = {
          + "Name" = "staging_public_key"
        }
      + tags_all        = {
          + "Name" = "staging_public_key"
        }
    }

  # aws_security_group.production_rules will be destroyed
  # (because aws_security_group.production_rules is not in configuration)
  - resource "aws_security_group" "production_rules" {
      - arn                    = "arn:aws:ec2:us-east-1:608337043546:security-group/sg-027221a763bdfebff" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-027221a763bdfebff" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP access"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "SSH access"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "production_rules" -> null
      - owner_id               = "608337043546" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "allow_tls"
        } -> null
      - tags_all               = {
          - "Name" = "allow_tls"
        } -> null
      - vpc_id                 = "vpc-05f85e62f4f640f0f" -> null
    }

  # aws_security_group.staging_rules will be created
  + resource "aws_security_group" "staging_rules" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "staging_rules"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_tls"
        }
      + tags_all               = {
          + "Name" = "allow_tls"
        }
      + vpc_id                 = (known after apply)
    }

  # random_id.server_PR_2 will be created
  + resource "random_id" "server_PR_2" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = "ami-007855ac798b5175e"
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - production_dns   = "ec2-54-208-172-169.compute-1.amazonaws.com" -> null
  + staging_dns_PR_2 = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "production_public_key"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-zipsznb7SuP8344G/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @AndresDavidArcos, Action: `workflow_dispatch`*